//=============================================================================
//
//	フェード処理
//	Author:日野澤匠泉	[fade.cpp]
//
//=============================================================================

//*****************************************************************************
//インクルード
//*****************************************************************************
#include "main.h"
#include "fade.h"
#include "object2D.h"
#include "manager.h"
#include "renderer.h"

//=============================================================================
//	コンストラクタ
//=============================================================================
CFade::CFade()
{
	m_fade = FADE_IN;
	m_colorFade = D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f);
}

//=============================================================================
//	デストラクタ
//=============================================================================
CFade::~CFade()
{

}

//=============================================================================
//	フェードの初期化処理
//=============================================================================
void CFade::Init(CScene::MODE modeNext)
{
	m_fade = FADE_IN;										//フェードイン状態に
	m_modeNext = modeNext;									//次の画面(モード)を設定
	m_colorFade = D3DXCOLOR(0.0f, 0.0f, 0.0f, 1.0f);		//黒いポリゴン(不透明)にしておく

	// cobject2Dの初期化  //

	//モードの設定
	Set(m_modeNext);
}

//=============================================================================
//	フェードの終了処理
//=============================================================================
void CFade::Uninit(void)
{
	// cobject2Dの	終了  //
}

//=============================================================================
//	フェードの更新処理
//=============================================================================
void CFade::Update(void)
{
	if (m_fade != FADE_NONE)
	{
		if (m_fade == FADE_IN)
		{//フェードイン設定
			m_colorFade.a -= 0.039f;		//ポリゴンを透明にしていく

			if (m_colorFade.a <= 0.0f)
			{
				m_colorFade.a = 0.0f;
				m_fade = FADE_NONE;		//何もしていない状態に
			}
		}

		else if (m_fade == FADE_OUT)
		{//フェードアウト状態
			m_colorFade.a += 0.039f;		//ポリゴンを不透明にしていく

			if (m_colorFade.a >= 1.0f)
			{
				m_colorFade.a = 1.0f;
				m_fade = FADE_IN;		//フェードイン状態に

				//モード設定(次の画面に移行)
				Set(m_modeNext);
			}
		}

		//セットカラーの様なもののα値に m_colorFade.a突っ込む

	}
}

//=============================================================================
//	フェードの描画処理
//=============================================================================
void CFade::Draw(void)
{
	// cobject2Dの	描画  //
}

//=============================================================================
//	フェードの設定処理
//=============================================================================
void CFade::Set(CScene::MODE modeNext)
{
	if (m_fade == FADE_NONE)
	{
		m_fade = FADE_OUT;								//フェードアウト状態に
		m_modeNext = modeNext;							//次の画面(モード)を設定
		m_colorFade = D3DXCOLOR(0.0f, 0.0f, 0.0f, 0.0f);	//黒いポリゴン(透明)にしておく
	}
}

//=============================================================================
//	フェードの取得処理
//=============================================================================
CFade::FADE CFade::Get(void)
{
	return m_fade;
}