//=========================================================================================
//
//	ポーズ処理
//	Author:日野澤匠泉	[pause.h]
//
//=========================================================================================
#ifndef _PAUSE_H_                  //このマクロ定義がされてなかったら
#define _PAUSE_H_                  //2重インクルード防止のマクロを定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "object2D.h"

//*****************************************************************************************
//ポーズクラス
//*****************************************************************************************
class CPause : public CObject2D
{
public:
	//ポーズメニュー
	typedef enum
	{
		PAUSE_MENU_CONTINUE = 0,   //コンティニュー
		PAUSE_MENU_RETRY,          //リトライ
		PAUSE_MENU_QUIT,           //終了
		PAUSE_MENU_MAX
	}PAUSE_MENU;

	CPause();
	~CPause();
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CPause *Create(void);

private:
	int m_nPauseMenu;	//ポーズメニュー
	bool m_bPause;		//ポーズが使用されているかどうか	
};

#endif
