//=========================================================================================
//
//[renderer.h]
//Author:日野澤匠泉
//
//=========================================================================================
#ifndef _RENDERER_H_			//このマクロ定義がされなかったら
#define _RENDERER_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "main.h"

//*****************************************************************************************
//マクロ定義
//*****************************************************************************************
#define MAX_VERTEX	(4)		//頂点最大数

//*****************************************************************************************
//クラス定義
//*****************************************************************************************
class CRenderer
{
public:
	CRenderer();
	~CRenderer();

	HRESULT Init(HWND hWnd,BOOL bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	LPDIRECT3DDEVICE9 GetDevice(void);

private:
	LPDIRECT3D9	m_pD3D;						//Direct3Dオブジェクトへのポインタ
	LPDIRECT3DDEVICE9	m_pD3DDevice;		//Direct3Dデバイスへのポインタ
};

#endif

