//=========================================================================================
//
//[title.h]
//Author:日野澤匠泉
//
//=========================================================================================
#ifndef _TITLE_H_			//このマクロ定義がされなかったら
#define _TITLE_H_			//2重インクルード防止のマクロ定義する

//*****************************************************************************************
//前方宣言
//*****************************************************************************************
class CModeImage;
class CCamera;
class CObjectX;
class CLight;

//*****************************************************************************************
//インクルード
//*****************************************************************************************
#include "manager.h"

//*****************************************************************************************
//クラス定義
//*****************************************************************************************
class CTitle : public CScene
{
public:

	CTitle();
	~CTitle();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static CTitle *Create(void);

private:
	CModeImage *m_pModeImage;
	CCamera *m_pCamera;
	CObjectX *m_pObjectX;
	CLight *m_pLight;
	int m_nCtr;
	int m_nTrans;
	bool bUse;
	bool bSound;
};

#endif
